
class 玩家:
    def __init__(self,帽子名称,鞋子名称,餐食名称,武器名称) -> None:
        self.帽子= 帽子名称
        self.鞋子= 鞋子名称
        self.吃食= 餐食名称
        self.武器= 武器名称

class 新手(玩家):

    def __init__(self,帽子名称,鞋子名称,餐食名称,交通工具名称,武器名称) -> None:
        super(新手, self).__init__(帽子名称,鞋子名称,餐食名称,武器名称)
        self.交通工具=交通工具名称
        # self.武器 = 武器名称
    def test_fun(self):
        print(self.武器)

    def road(self):
        print("123")

class 资深玩家(新手):

    def __init__(self, 帽子名称,鞋子名称,餐食名称,交通工具名称,武器名称) -> None:
        super().__init__(帽子名称,鞋子名称,餐食名称,交通工具名称,武器名称)
        self.帽子 = 帽子名称
        self.鞋子 = 鞋子名称
        self.吃食 = 餐食名称
        self.交通工具 = 交通工具名称
        self.包裹= {}
    def 放入包裹(self,物品名称,物品):
        self.包裹[物品名称]=物品
    def 取出(self,物品名称):
        return self.包裹.get(物品名称)
    def 刷困难副本(self):
        print("取出武器")
        print(self.取出("🗡1"))

新手1号 = 新手("遮阳帽","破旧的塑料鞋","红烧狮子头","普通公路自行车","大剑")
新手1号.test_fun()

资深玩家1号 = 资深玩家("大嘴帽","鞋子","红烧肉","奔驰","大剑")
资深玩家1号.test_fun()
资深玩家1号.放入包裹("🗡1","轩辕剑")
资深玩家1号.放入包裹("破剑","破旧的铁剑")
资深玩家1号.放入包裹("破剑1","破旧的铁剑1")
资深玩家1号.放入包裹("宽度数组",[
    [111,22],
    [22,333]
])
print(资深玩家1号.取出("宽度数组"))